MikroElektronika/core_packages/PIC/XC8/def/PIC18F248/mcu.h
// Generated 05/01/2024 GMT

/*
 * Copyright © 2024, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F248_H_
#define _PIC18F248_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18F248
 */
#ifndef _XC_H_
#warning Header file pic18f248.h included directly. Use #include <xc.h> instead.
#endif

#include <__at.h>

/*
 * Register Definitions
 */

// Register: RXF0SIDH
#define RXF0SIDH RXF0SIDH
extern volatile unsigned char           RXF0SIDH            __at(0xF00);
#ifndef _LIB_BUILD
asm("RXF0SIDH equ 0F00h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF0SID3               :1;
        unsigned RXF0SID4               :1;
        unsigned RXF0SID5               :1;
        unsigned RXF0SID6               :1;
        unsigned RXF0SID7               :1;
        unsigned RXF0SID8               :1;
        unsigned RXF0SID9               :1;
        unsigned RXF0SID10              :1;
    };
} RXF0SIDHbits_t;
extern volatile RXF0SIDHbits_t RXF0SIDHbits __at(0xF00);
// bitfield macros
#define _RXF0SIDH_SID3_POSN                                 0x0
#define _RXF0SIDH_SID3_POSITION                             0x0
#define _RXF0SIDH_SID3_SIZE                                 0x1
#define _RXF0SIDH_SID3_LENGTH                               0x1
#define _RXF0SIDH_SID3_MASK                                 0x1
#define _RXF0SIDH_SID4_POSN                                 0x1
#define _RXF0SIDH_SID4_POSITION                             0x1
#define _RXF0SIDH_SID4_SIZE                                 0x1
#define _RXF0SIDH_SID4_LENGTH                               0x1
#define _RXF0SIDH_SID4_MASK                                 0x2
#define _RXF0SIDH_SID5_POSN                                 0x2
#define _RXF0SIDH_SID5_POSITION                             0x2
#define _RXF0SIDH_SID5_SIZE                                 0x1
#define _RXF0SIDH_SID5_LENGTH                               0x1
#define _RXF0SIDH_SID5_MASK                                 0x4
#define _RXF0SIDH_SID6_POSN                                 0x3
#define _RXF0SIDH_SID6_POSITION                             0x3
#define _RXF0SIDH_SID6_SIZE                                 0x1
#define _RXF0SIDH_SID6_LENGTH                               0x1
#define _RXF0SIDH_SID6_MASK                                 0x8
#define _RXF0SIDH_SID7_POSN                                 0x4
#define _RXF0SIDH_SID7_POSITION                             0x4
#define _RXF0SIDH_SID7_SIZE                                 0x1
#define _RXF0SIDH_SID7_LENGTH                               0x1
#define _RXF0SIDH_SID7_MASK                                 0x10
#define _RXF0SIDH_SID8_POSN                                 0x5
#define _RXF0SIDH_SID8_POSITION                             0x5
#define _RXF0SIDH_SID8_SIZE                                 0x1
#define _RXF0SIDH_SID8_LENGTH                               0x1
#define _RXF0SIDH_SID8_MASK                                 0x20
#define _RXF0SIDH_SID9_POSN                                 0x6
#define _RXF0SIDH_SID9_POSITION                             0x6
#define _RXF0SIDH_SID9_SIZE                                 0x1
#define _RXF0SIDH_SID9_LENGTH                               0x1
#define _RXF0SIDH_SID9_MASK                                 0x40
#define _RXF0SIDH_SID10_POSN                                0x7
#define _RXF0SIDH_SID10_POSITION                            0x7
#define _RXF0SIDH_SID10_SIZE                                0x1
#define _RXF0SIDH_SID10_LENGTH                              0x1
#define _RXF0SIDH_SID10_MASK                                0x80
#define _RXF0SIDH_RXF0SID3_POSN                             0x0
#define _RXF0SIDH_RXF0SID3_POSITION                         0x0
#define _RXF0SIDH_RXF0SID3_SIZE                             0x1
#define _RXF0SIDH_RXF0SID3_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID3_MASK                             0x1
#define _RXF0SIDH_RXF0SID4_POSN                             0x1
#define _RXF0SIDH_RXF0SID4_POSITION                         0x1
#define _RXF0SIDH_RXF0SID4_SIZE                             0x1
#define _RXF0SIDH_RXF0SID4_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID4_MASK                             0x2
#define _RXF0SIDH_RXF0SID5_POSN                             0x2
#define _RXF0SIDH_RXF0SID5_POSITION                         0x2
#define _RXF0SIDH_RXF0SID5_SIZE                             0x1
#define _RXF0SIDH_RXF0SID5_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID5_MASK                             0x4
#define _RXF0SIDH_RXF0SID6_POSN                             0x3
#define _RXF0SIDH_RXF0SID6_POSITION                         0x3
#define _RXF0SIDH_RXF0SID6_SIZE                             0x1
#define _RXF0SIDH_RXF0SID6_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID6_MASK                             0x8
#define _RXF0SIDH_RXF0SID7_POSN                             0x4
#define _RXF0SIDH_RXF0SID7_POSITION                         0x4
#define _RXF0SIDH_RXF0SID7_SIZE                             0x1
#define _RXF0SIDH_RXF0SID7_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID7_MASK                             0x10
#define _RXF0SIDH_RXF0SID8_POSN                             0x5
#define _RXF0SIDH_RXF0SID8_POSITION                         0x5
#define _RXF0SIDH_RXF0SID8_SIZE                             0x1
#define _RXF0SIDH_RXF0SID8_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID8_MASK                             0x20
#define _RXF0SIDH_RXF0SID9_POSN                             0x6
#define _RXF0SIDH_RXF0SID9_POSITION                         0x6
#define _RXF0SIDH_RXF0SID9_SIZE                             0x1
#define _RXF0SIDH_RXF0SID9_LENGTH                           0x1
#define _RXF0SIDH_RXF0SID9_MASK                             0x40
#define _RXF0SIDH_RXF0SID10_POSN                            0x7
#define _RXF0SIDH_RXF0SID10_POSITION                        0x7
#define _RXF0SIDH_RXF0SID10_SIZE                            0x1
#define _RXF0SIDH_RXF0SID10_LENGTH                          0x1
#define _RXF0SIDH_RXF0SID10_MASK                            0x80

// Register: RXF0SIDL
#define RXF0SIDL RXF0SIDL
extern volatile unsigned char           RXF0SIDL            __at(0xF01);
#ifndef _LIB_BUILD
asm("RXF0SIDL equ 0F01h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF0EID16              :1;
        unsigned RXF0EID17              :1;
        unsigned                        :1;
        unsigned RXF0EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF0SID0               :1;
        unsigned RXF0SID1               :1;
        unsigned RXF0SID2               :1;
    };
} RXF0SIDLbits_t;
extern volatile RXF0SIDLbits_t RXF0SIDLbits __at(0xF01);
// bitfield macros
#define _RXF0SIDL_EID16_POSN                                0x0
#define _RXF0SIDL_EID16_POSITION                            0x0
#define _RXF0SIDL_EID16_SIZE                                0x1
#define _RXF0SIDL_EID16_LENGTH                              0x1
#define _RXF0SIDL_EID16_MASK                                0x1
#define _RXF0SIDL_EID17_POSN                                0x1
#define _RXF0SIDL_EID17_POSITION                            0x1
#define _RXF0SIDL_EID17_SIZE                                0x1
#define _RXF0SIDL_EID17_LENGTH                              0x1
#define _RXF0SIDL_EID17_MASK                                0x2
#define _RXF0SIDL_EXIDEN_POSN                               0x3
#define _RXF0SIDL_EXIDEN_POSITION                           0x3
#define _RXF0SIDL_EXIDEN_SIZE                               0x1
#define _RXF0SIDL_EXIDEN_LENGTH                             0x1
#define _RXF0SIDL_EXIDEN_MASK                               0x8
#define _RXF0SIDL_SID0_POSN                                 0x5
#define _RXF0SIDL_SID0_POSITION                             0x5
#define _RXF0SIDL_SID0_SIZE                                 0x1
#define _RXF0SIDL_SID0_LENGTH                               0x1
#define _RXF0SIDL_SID0_MASK                                 0x20
#define _RXF0SIDL_SID1_POSN                                 0x6
#define _RXF0SIDL_SID1_POSITION                             0x6
#define _RXF0SIDL_SID1_SIZE                                 0x1
#define _RXF0SIDL_SID1_LENGTH                               0x1
#define _RXF0SIDL_SID1_MASK                                 0x40
#define _RXF0SIDL_SID2_POSN                                 0x7
#define _RXF0SIDL_SID2_POSITION                             0x7
#define _RXF0SIDL_SID2_SIZE                                 0x1
#define _RXF0SIDL_SID2_LENGTH                               0x1
#define _RXF0SIDL_SID2_MASK                                 0x80
#define _RXF0SIDL_RXF0EID16_POSN                            0x0
#define _RXF0SIDL_RXF0EID16_POSITION                        0x0
#define _RXF0SIDL_RXF0EID16_SIZE                            0x1
#define _RXF0SIDL_RXF0EID16_LENGTH                          0x1
#define _RXF0SIDL_RXF0EID16_MASK                            0x1
#define _RXF0SIDL_RXF0EID17_POSN                            0x1
#define _RXF0SIDL_RXF0EID17_POSITION                        0x1
#define _RXF0SIDL_RXF0EID17_SIZE                            0x1
#define _RXF0SIDL_RXF0EID17_LENGTH                          0x1
#define _RXF0SIDL_RXF0EID17_MASK                            0x2
#define _RXF0SIDL_RXF0EXIDEN_POSN                           0x3
#define _RXF0SIDL_RXF0EXIDEN_POSITION                       0x3
#define _RXF0SIDL_RXF0EXIDEN_SIZE                           0x1
#define _RXF0SIDL_RXF0EXIDEN_LENGTH                         0x1
#define _RXF0SIDL_RXF0EXIDEN_MASK                           0x8
#define _RXF0SIDL_RXF0SID0_POSN                             0x5
#define _RXF0SIDL_RXF0SID0_POSITION                         0x5
#define _RXF0SIDL_RXF0SID0_SIZE                             0x1
#define _RXF0SIDL_RXF0SID0_LENGTH                           0x1
#define _RXF0SIDL_RXF0SID0_MASK                             0x20
#define _RXF0SIDL_RXF0SID1_POSN                             0x6
#define _RXF0SIDL_RXF0SID1_POSITION                         0x6
#define _RXF0SIDL_RXF0SID1_SIZE                             0x1
#define _RXF0SIDL_RXF0SID1_LENGTH                           0x1
#define _RXF0SIDL_RXF0SID1_MASK                             0x40
#define _RXF0SIDL_RXF0SID2_POSN                             0x7
#define _RXF0SIDL_RXF0SID2_POSITION                         0x7
#define _RXF0SIDL_RXF0SID2_SIZE                             0x1
#define _RXF0SIDL_RXF0SID2_LENGTH                           0x1
#define _RXF0SIDL_RXF0SID2_MASK                             0x80

// Register: RXF0EIDH
#define RXF0EIDH RXF0EIDH
extern volatile unsigned char           RXF0EIDH            __at(0xF02);
#ifndef _LIB_BUILD
asm("RXF0EIDH equ 0F02h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXF0EID8               :1;
        unsigned RXF0EID9               :1;
        unsigned RXF0EID10              :1;
        unsigned RXF0EID11              :1;
        unsigned RXF0EID12              :1;
        unsigned RXF0EID13              :1;
        unsigned RXF0EID14              :1;
        unsigned RXF0EID15              :1;
    };
} RXF0EIDHbits_t;
