MikroElektronika/core_packages/PIC/XC8/def/PIC18F248/mcu.h
// Register: RXF5SIDH
#define RXF5SIDH RXF5SIDH
extern volatile unsigned char           RXF5SIDH            __at(0xF14);
#ifndef _LIB_BUILD
asm("RXF5SIDH equ 0F14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF5SID3               :1;
        unsigned RXF5SID4               :1;
        unsigned RXF5SID5               :1;
        unsigned RXF5SID6               :1;
        unsigned RXF5SID7               :1;
        unsigned RXF5SID8               :1;
        unsigned RXF5SID9               :1;
        unsigned RXF5SID10              :1;
    };
} RXF5SIDHbits_t;
extern volatile RXF5SIDHbits_t RXF5SIDHbits __at(0xF14);
// bitfield macros
#define _RXF5SIDH_SID3_POSN                                 0x0
#define _RXF5SIDH_SID3_POSITION                             0x0
#define _RXF5SIDH_SID3_SIZE                                 0x1
#define _RXF5SIDH_SID3_LENGTH                               0x1
#define _RXF5SIDH_SID3_MASK                                 0x1
#define _RXF5SIDH_SID4_POSN                                 0x1
#define _RXF5SIDH_SID4_POSITION                             0x1
#define _RXF5SIDH_SID4_SIZE                                 0x1
#define _RXF5SIDH_SID4_LENGTH                               0x1
#define _RXF5SIDH_SID4_MASK                                 0x2
#define _RXF5SIDH_SID5_POSN                                 0x2
#define _RXF5SIDH_SID5_POSITION                             0x2
#define _RXF5SIDH_SID5_SIZE                                 0x1
#define _RXF5SIDH_SID5_LENGTH                               0x1
#define _RXF5SIDH_SID5_MASK                                 0x4
#define _RXF5SIDH_SID6_POSN                                 0x3
#define _RXF5SIDH_SID6_POSITION                             0x3
#define _RXF5SIDH_SID6_SIZE                                 0x1
#define _RXF5SIDH_SID6_LENGTH                               0x1
#define _RXF5SIDH_SID6_MASK                                 0x8
#define _RXF5SIDH_SID7_POSN                                 0x4
#define _RXF5SIDH_SID7_POSITION                             0x4
#define _RXF5SIDH_SID7_SIZE                                 0x1
#define _RXF5SIDH_SID7_LENGTH                               0x1
#define _RXF5SIDH_SID7_MASK                                 0x10
#define _RXF5SIDH_SID8_POSN                                 0x5
#define _RXF5SIDH_SID8_POSITION                             0x5
#define _RXF5SIDH_SID8_SIZE                                 0x1
#define _RXF5SIDH_SID8_LENGTH                               0x1
#define _RXF5SIDH_SID8_MASK                                 0x20
#define _RXF5SIDH_SID9_POSN                                 0x6
#define _RXF5SIDH_SID9_POSITION                             0x6
#define _RXF5SIDH_SID9_SIZE                                 0x1
#define _RXF5SIDH_SID9_LENGTH                               0x1
#define _RXF5SIDH_SID9_MASK                                 0x40
#define _RXF5SIDH_SID10_POSN                                0x7
#define _RXF5SIDH_SID10_POSITION                            0x7
#define _RXF5SIDH_SID10_SIZE                                0x1
#define _RXF5SIDH_SID10_LENGTH                              0x1
#define _RXF5SIDH_SID10_MASK                                0x80
#define _RXF5SIDH_RXF5SID3_POSN                             0x0
#define _RXF5SIDH_RXF5SID3_POSITION                         0x0
#define _RXF5SIDH_RXF5SID3_SIZE                             0x1
#define _RXF5SIDH_RXF5SID3_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID3_MASK                             0x1
#define _RXF5SIDH_RXF5SID4_POSN                             0x1
#define _RXF5SIDH_RXF5SID4_POSITION                         0x1
#define _RXF5SIDH_RXF5SID4_SIZE                             0x1
#define _RXF5SIDH_RXF5SID4_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID4_MASK                             0x2
#define _RXF5SIDH_RXF5SID5_POSN                             0x2
#define _RXF5SIDH_RXF5SID5_POSITION                         0x2
#define _RXF5SIDH_RXF5SID5_SIZE                             0x1
#define _RXF5SIDH_RXF5SID5_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID5_MASK                             0x4
#define _RXF5SIDH_RXF5SID6_POSN                             0x3
#define _RXF5SIDH_RXF5SID6_POSITION                         0x3
#define _RXF5SIDH_RXF5SID6_SIZE                             0x1
#define _RXF5SIDH_RXF5SID6_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID6_MASK                             0x8
#define _RXF5SIDH_RXF5SID7_POSN                             0x4
#define _RXF5SIDH_RXF5SID7_POSITION                         0x4
#define _RXF5SIDH_RXF5SID7_SIZE                             0x1
#define _RXF5SIDH_RXF5SID7_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID7_MASK                             0x10
#define _RXF5SIDH_RXF5SID8_POSN                             0x5
#define _RXF5SIDH_RXF5SID8_POSITION                         0x5
#define _RXF5SIDH_RXF5SID8_SIZE                             0x1
#define _RXF5SIDH_RXF5SID8_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID8_MASK                             0x20
#define _RXF5SIDH_RXF5SID9_POSN                             0x6
#define _RXF5SIDH_RXF5SID9_POSITION                         0x6
#define _RXF5SIDH_RXF5SID9_SIZE                             0x1
#define _RXF5SIDH_RXF5SID9_LENGTH                           0x1
#define _RXF5SIDH_RXF5SID9_MASK                             0x40
#define _RXF5SIDH_RXF5SID10_POSN                            0x7
#define _RXF5SIDH_RXF5SID10_POSITION                        0x7
#define _RXF5SIDH_RXF5SID10_SIZE                            0x1
#define _RXF5SIDH_RXF5SID10_LENGTH                          0x1
#define _RXF5SIDH_RXF5SID10_MASK                            0x80

// Register: RXF5SIDL
#define RXF5SIDL RXF5SIDL
extern volatile unsigned char           RXF5SIDL            __at(0xF15);
#ifndef _LIB_BUILD
asm("RXF5SIDL equ 0F15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF5EID16              :1;
        unsigned RXF5EID17              :1;
        unsigned                        :1;
        unsigned RXF5EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF5SID0               :1;
        unsigned RXF5SID1               :1;
        unsigned RXF5SID2               :1;
    };
} RXF5SIDLbits_t;
